Revit 2026 API

# ConnectorAssignedDuctLossMethod Property

---

The duct loss method of the connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DuctLossMethodType AssignedDuctLossMethod { get; }
```
```vb
Public ReadOnly Property AssignedDuctLossMethod As DuctLossMethodType
	Get
```
```cpp
public:
property DuctLossMethodType AssignedDuctLossMethod {
	DuctLossMethodType get ();
}
```
```fsharp
member AssignedDuctLossMethod : DuctLossMethodType with get
```

#### Property Value

DuctLossMethodType

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the connector's domain is not DomainHvac. Thrown when the connector is not in family instance. |
| InvalidOperationException | Thrown on failure to get duct loss method. |

Assigned duct loss method may be assigned for connectors of some family instances.

#### Reference

Connector Class

Autodesk.Revit.DB Namespace